# St7SetSolverDefaultsLogical

Sets a series of Boolean parameters for the analysis.

long St7SetSolverDefaultsLogical(long uID, long Parameter, bool Value)

Input Parameters

uID

Strand7 model file ID.

Solver – General

Parameter

Solver logical parameter; see Logical Parameters.

Value

Either True or False.